# coding=utf-8

from __future__ import unicode_literals
from .. import Provider as LoremProvider


class Provider(LoremProvider):
    word_list = (
        "বাতাসে ", "বহিছে",  "নয়নে",  "লাগিল",  "নেশা",  "কারা",  "যে", "ডাকিল", "পিছে", "গেছে", "মধুর" , "অমৃত",  "বাণী",  "বেলা", "গেল", "সহজেই", "মরমে", "উঠিল", "বাজি", "থাক", "তব", "ভুবনের", "ধুলি", "মাখা", "চরণে", "মাথা", "নত", "করে", "রব", "এসে", "গেছে", "এসে", "গেছে", "গগনের", "নভোঃনীলে", "গোপনে", "বাজে", "বাজে", "ঐ", "বাজে", "ঐ", "পলাশের", "নেশা", "মাখি", "চলেছি", "দুজনে", "বাসনার", "রং", "এ" , "মিশি", "কুহু", "কুহু", "শোনা", "যায়", "কোকিলের", "কুহুতান", "এসে", "গেছে", "এসে", "গেছে", "পূর্নিমা", "রাতে", "ঐ", "ছোটা", "ছুটি", "করে", "কারা", "দখিনা", "পবনে", "দোলে", "এসে", "গেছে", "কেমনে", "গাঁথিব", "মালা", "কেমনে", "বাজিবে", "বেণু", "আবেগে", "কাপিছে", "আঁখি", "এসে", "গেছে", "থাক", "তব", "ভুবনের", "ধুলি", "মাখা", "চরণে", "মাথা", "নত", "করে", "রব", "এসে", "গেছে", "এসে", "গেছে", "এসে", "গেছে", "এসে", "গেছে", "এই", "অনেক", "আগে", "তোমায়", "দেখেছিলেম", "আমি", "হেটেছিলেম", "নিরুদ্দেশের", "পানে", "সেই", "এখন", "ভীষণ", "দামি", "আমার", "কাছে", "তোমার", "কাছে", "আমার", "কাছে", "এসে", "গেছে", "থাক", "তব", "ভুবনের", "ধুলি", "মাখা", "চরণে", "মাথা", "নত", "করে", "এসে", "গেছে", "এসে", "গেছে", "এসে", "গেছে", "এসে", "গেছে", "এসে", "গেছে",
    )
